In [2]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Collecting mysql-connector-python
  Using cached mysql_connector_python-8.1.0-cp310-cp310-manylinux_2_17_x86_64.whl (27.5 MB)
Collecting protobuf<=4.21.12,>=4.21.1
  Using cached protobuf-4.21.12-cp37-abi3-manylinux2014_x86_64.whl (409 kB)
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.1.0 protobuf-4.21.12

In [2]:
import mysql.connector
import pandas as pd

In [3]:
db = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="Helloworld@123",
    database="bab"
)

cursor = db.cursor()

In [9]:
cursor.reset()
result = cursor.execute("select * from BURGER")

In [18]:
df = pd.read_sql("select * from BURGER", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [19]:
df

   burgerId   name   size
0         1   SWAT  small
1         2  SWATy  small

In [21]:
#Rename Column names
cursor.execute("alter table BURGER rename column burgerId to BurgerId")

In [28]:
cursor.reset()
df = pd.read_sql("show tables;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [29]:
df

Empty DataFrame
Columns: [Tables_in_bab]
Index: []

In [27]:
cursor.execute("drop table BURGER, gfg")

In [30]:
# Data modelling

# Organize business problems into different tables and visualise
# Data scientist - Model for prediction
# Relational Data model - simple querying and relationship between tables
# RDBM - Entities, characteristics, relationship

In [39]:
## Databases are used in DS to store predictions for future use, store scrapped data from websites and process it for later

In [68]:
cursor.execute("drop table shoes")

In [73]:
cursor.execute("create table shoes (id INTEGER PRIMARY KEY AUTO_INCREMENT, name varchar(20) NOT NULL, brand varchar(20) NOT NULL, color varchar(20) NOT NULL, price decimal(8, 2) NOT NULL, description varchar(200) NULL )")

In [74]:
cursor.reset()
pd.read_sql("describe table shoes;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,shoes,None,ALL,None,None,None,None,1,100.0,None

In [76]:
cursor.execute("insert into shoes values(1, 'sneakers', 'adidas', 'white', 13.5, NULL)")

In [77]:
pd.read_sql("select * from shoes;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id      name   brand  color  price description
0   1  sneakers  adidas  white   13.5        None

In [78]:
cursor.execute("insert into shoes (name, brand, color, price, description) values('sneakers1', 'adidassdf', 'whitedfs', 123.5, NULL)")

In [79]:
pd.read_sql("select * from shoes;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id       name      brand     color  price description
0   1   sneakers     adidas     white   13.5        None
1   2  sneakers1  adidassdf  whitedfs  123.5        None

In [87]:
cursor.execute("create table shoes2 LIKE shoes") # Clone a table with just its attributes

ProgrammingError: 1050 (42S01): Table 'shoes2' already exists

In [88]:
cursor.execute("show tables;")

In [89]:
cursor.reset()
pd.read_sql("select * from shoes2;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

Empty DataFrame
Columns: [id, name, brand, color, price, description]
Index: []

In [90]:
cursor.execute("create table shoes3 AS SELECT * FROM shoes") # Create a duplicate table with all entities

In [91]:
cursor.reset()
pd.read_sql("select * from shoes3;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id       name      brand     color  price description
0   1   sneakers     adidas     white   13.5        None
1   2  sneakers1  adidassdf  whitedfs  123.5        None

In [93]:
cursor.execute("insert into shoes (name, brand, color, price, description) values('loafers', 'adva', 'whitedfs', 123.15, NULL)")

In [94]:
cursor.execute("insert into shoes (name, brand, color, price, description) values('loby', 'adva', 'whitedfs', 133.5, NULL)")

In [96]:
# Create temporary tables - faster for complex query operations
cursor.execute("create temporary table Adva AS select * from shoes where brand='adva'")

In [102]:
cursor.reset()
pd.read_sql("select * from Adva;", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name brand     color   price description
0   4  loafers  adva  whitedfs  123.15        None
1   5     loby  adva  whitedfs  133.50        None

In [103]:
# create a table only if the table name doesn't exists in the Database
cursor.execute("create table if not exists Adva LIKE shoes") # Table won't be created and errors will be supressed

In [104]:
pd.read_sql("show tables", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  Tables_in_bab
0          Adva
1         shoes
2        shoes2
3        shoes3

In [107]:
# Select Distinct values
pd.read_sql("select DISTINCT color from shoes", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      color
0     white
1  whitedfs

In [111]:
# Select rows which have substring
pd.read_sql("select * from shoes where name LIKE '%loaf%'", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name      brand     color   price description
0   3  loafers  adidassdf  whitedfs  123.15        None
1   4  loafers       adva  whitedfs  123.15        None

In [118]:
#####################################################################################################

In [114]:
# Get all records except loafers

pd.read_sql("select * from shoes where name <> 'loafers'", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id       name      brand     color  price description
0   1   sneakers     adidas     white   13.5        None
1   2  sneakers1  adidassdf  whitedfs  123.5        None
2   5       loby       adva  whitedfs  133.5        None

In [115]:
# Get all records between range of price values

pd.read_sql("select * from shoes where price between 100 and 200", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id       name      brand     color   price description
0   2  sneakers1  adidassdf  whitedfs  123.50        None
1   3    loafers  adidassdf  whitedfs  123.15        None
2   4    loafers       adva  whitedfs  123.15        None
3   5       loby       adva  whitedfs  133.50        None

In [116]:
# IN operator

pd.read_sql("select * from shoes where name in ('loafers', 'loby')", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name      brand     color   price description
0   3  loafers  adidassdf  whitedfs  123.15        None
1   4  loafers       adva  whitedfs  123.15        None
2   5     loby       adva  whitedfs  133.50        None

In [124]:
# OR operator (Gives only one match if frst condition is met)

pd.read_sql("select * from shoes where name= 'loby' or 'loafers'", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id  name brand     color  price description
0   5  loby  adva  whitedfs  133.5        None

In [126]:
# AND operator,  OR within will return both matches (Always use paranthesis when using OR and AND together)

pd.read_sql("select * from shoes where (name= 'loby' or name = 'loafers') and brand = 'adva'", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   id     name brand     color   price description
0   4  loafers  adva  whitedfs  123.15        None
1   5     loby  adva  whitedfs  133.50        None

In [ ]:
# Load csv to DB

In [225]:
# CSV
cs = pd.read_csv("ir.csv")

In [226]:
cs.columns
cs.head()

cs['ID'] = cs.index+1

In [227]:
cs.head()
cs.columns = cs.columns.str.replace(" ", "")
columns = list(cs.columns)
columns

['Invoice',
 'StockCode',
 'Description',
 'Quantity',
 'InvoiceDate',
 'Price',
 'CustomerID',
 'Country',
 'ID']

In [228]:
# Clean the data

In [229]:
cs["Description"] = cs["Description"].str.replace("\"", "\'")
cs = cs.dropna()

In [230]:
#delete all entries from a table
cursor.execute("drop table retail")

In [231]:
cursor.execute("create table retail (%s varchar(20) NOT NULL, %s varchar(20) NOT NULL, %s varchar(100), %s INTEGER NOT NULL, %s varchar(30) NOT NULL, %s DECIMAL(8, 2) NOT NULL, %s INTEGER NOT NULL, %s VARCHAR(20) NOT NULL, %s INTEGER PRIMARY KEY AUTO_INCREMENT)" % tuple(columns))

In [232]:
pd.read_sql("describe table retail", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,select_type,table,partitions,type,possible_keys,key,key_len,ref,rows,filtered,Extra
0,1,SIMPLE,retail,None,ALL,None,None,None,None,1,100.0,None

In [233]:
pd.read_sql("select * from retail", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

Empty DataFrame
Columns: [Invoice, StockCode, Description, Quantity, InvoiceDate, Price, CustomerID, Country, ID]
Index: []

In [145]:
cursor.execute("delete from retail")

In [234]:
for row in cs.itertuples():
    cursor.execute(f'insert into retail values("{row.Invoice}", "{row.StockCode}", "{row.Description}", {row.Quantity}, "{row.InvoiceDate}", {row.Price}, {row.CustomerID}, "{row.Country}", {row.ID})')

In [241]:
# To commit all changes to the database
db.commit()

In [215]:
#Wildcards
pd.read_sql("select * from retail where description LIKE '%CHRISTMAS%'", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,CustomerID,Country,ID
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085,United Kingdom,1
1,489436,22142,CHRISTMAS CRAFT WHITE FAIRY,12,12/1/2009 9:06,1.45,13078,United Kingdom,18
2,489437,22143,CHRISTMAS CRAFT HEART DECORATIONS,6,12/1/2009 9:08,2.10,15362,United Kingdom,32
3,489437,22145,CHRISTMAS CRAFT HEART STOCKING,6,12/1/2009 9:08,2.10,15362,United Kingdom,33
4,489437,22130,PARTY CONE CHRISTMAS DECORATION,12,12/1/2009 9:08,0.85,15362,United Kingdom,34
...,...,...,...,...,...,...,...,...,...
15603,538168,22086,PAPER CHAIN KIT 50'S CHRISTMAS,13,12/9/2010 19:23,2.95,14702,United Kingdom,525357
15604,538169,22910,PAPER CHAIN KIT VINTAGE CHRISTMAS,3,12/9/2010 19:28,2.95,13230,United Kingdom,525362
15605,538170,22910,PAPER CHAIN KIT VINTAGE CHRISTMAS,10,12/9/2010 19:32,2.95,13969,United Kingdom,525374
15606,538170,22086,PAPER CHAIN KIT 50'S CHRISTMAS,12,12/9/2010 19:32,2.95,13969,United Kingdom,525375
15607,538170,22943,CHRISTMAS LIGHTS 10 VINTAGE BAUBLES,1,12/9/2010 19:32,4.95,13969,United Kingdom,525395

In [216]:
# Sorting

pd.read_sql("select * from retail order by Invoice desc", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,CustomerID,Country,ID
0,C538164,35004B,SET OF 3 BLACK FLYING DUCKS,-1,12/9/2010 17:32,1.95,14031,United Kingdom,525283
1,C538124,22423,REGENCY CAKESTAND 3 TIER,-1,12/9/2010 15:43,12.75,15329,United Kingdom,524699
2,C538124,22699,ROSES REGENCY TEACUP AND SAUCER,-1,12/9/2010 15:43,2.95,15329,United Kingdom,524698
3,C538124,M,Manual,-4,12/9/2010 15:43,0.50,15329,United Kingdom,524697
4,C538123,22956,36 FOIL HEART CAKE CASES,-2,12/9/2010 15:41,2.10,12605,Germany,524696
...,...,...,...,...,...,...,...,...,...
417529,489434,22064,PINK DOUGHNUT TRINKET POT,24,12/1/2009 7:45,1.65,13085,United Kingdom,6
417530,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085,United Kingdom,5
417531,489434,22041,RECORD FRAME 7' SINGLE SIZE,48,12/1/2009 7:45,2.10,13085,United Kingdom,4
417532,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085,United Kingdom,3
417533,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085,United Kingdom,2

In [185]:
#Math
cursor.reset()
pd.read_sql("select DISTINCT CustomerID, Price * Quantity as Total_Price, Description from retail order by Total_Price desc", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        CustomerID  Total_Price                          Description
0            15838     15818.40  ROTATING SILVER ANGELS T-LIGHT HLDR
1            12918     10953.50                               Manual
2            14063     10468.80                               Manual
3            17949      8985.60                               Manual
4            18008      8925.00                  PINK PAPER PARASOL
...            ...          ...                                  ...
343020       15413     -7044.79                               Manual
343021       17949     -8985.60                               Manual
343022       14063    -10468.80                               Manual
343023       12918    -10953.50                               Manual
343024       17399    -25111.09                               Manual

[343025 rows x 3 columns]

In [217]:
# Aggregate function

# Average, sum, distinct, count, min. max

pd.read_sql("select avg(Price) as Average_Price from retail", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   Average_Price
0       3.887547

In [219]:
#Max price

pd.read_sql("select max(Price) from retail", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   max(Price)
0    25111.09

In [243]:
# Group by and Having (Where does not work in grouping)
#group by customer id to get total number of orders for each customer in descending order

pd.read_sql("select CustomerID, count(*) as orders from retail group by CustomerID having count(*) > 10 order by orders desc", con=db)

/home/blackbird/.local/lib/python3.10/site-packages/pandas/io/sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      CustomerID  orders
0          14911    5710
1          17841    5114
2          14606    3927
3          14156    2710
4          12748    2665
...          ...     ...
3737       18054      11
3738       15986      11
3739       12738      11
3740       17674      11
3741       12441      11

[3742 rows x 2 columns]

In [ ]:
# Subqueries